ack
awscli
casperjs
docker
docker-machine
fig
ffmpeg
flow
fpp
git
go
graphicsmagick
heroku-toolbelt
httpie
imagemagick
jq
ngrep
ngrok
phantomjs
postgresql
python
redis
rust
ssh-copy-id
tree
watch
wget
z
zsh
